package com.kh.oop;

public class InheritRun {
	/*
	 * 상속 - 다형성 - 인터페이스
	 * * 상속 : 부모 타입에서 가지고 있는 "멤버(변수, 메소드)"를
	 * 			자식 타입에서 직접 만들지 않고 상속을 받아 자신의 멤버처럼 사용할 수 있는 기술
	 * 
	 * 표현법 : extends 사용
	 * 
	 * 			class 클래스A extends 클래스B {}
	 * 			// 클래스B의 멤버를 클래스A에서 물려받음
	 * 			
	 * 			interface 인터페이스A extends 인터페이스B {}
	 * 			// 인터페이스B의 멤버를 인터페이스A에서 물려받음
	 * 
	 * * 오버라이딩 : 부모 타입에 정의되어 있는 메소드를
	 * 				자식 클래스에서 재정의하는 기술
	 * 		=> 조건) 반환형, 메소드명, 매개변수 정보가 일치해야 함
	 * 				접근제한자는 같은 범위이거나 더 큰 범위여야 함
	 * 				예외처리의 경우 같은 클래스거나 그 클래스의 자식클래스로만 가능
	 * 				--> throws (위임, 떠넘기기)
	 */

	public static void main(String[] args) {

	}

}
