package com.kh.oop;

public class PolyRun {
	/*
	 * * 다형성 : 부모 타입으로부터 파생된 여러 가지 타입의 자식 객체들을
	 * 				부모 타입 하나로 다룰 수 있는 기술
	 * 				=> 상속 관계여야 함 (부모-자식)
	 * 
	 * 			클래스명 참조변수 = new 자식클래스생성자;
	 * 	(부모 타입이 올 수 있음)   (자식 클래스의 생성자 사용 가능)
	 * 
	 *  * 클래스 간 형변환
	 *  	[1] 업캐스팅 : 자식 타입 --> 부모 타입 (자동 형변환)
	 *  			ex) 부모타입 변수 = 자식객체;
	 *  	[2] 다운캐스팅 : 부모 타입 --> 자식 타입 (강제 형변환)
	 *  			ex) ((자식타입)변수).자식메소드;
	 *  
	 *  			- instanceof 연산자
	 *  			: 현재 참조변수가 실제로 어떤 클래스타입의 객체를 참조하는 지 확인
	 *  			: 결과값 : true/false
	 *  
	 *  				참조변수명 instanceof 클래스타입
	 *  
	 *  * 동적 바인딩
	 *  	: 실제로 참조하는 자식클래스에 해당 메소드가 오버라이딩 되어 있다면
	 *  		프로그램 실행 시 동적으로 자식 클래스에 오버라이딩된 메소드를 찾아서 실행
	 *  	: 프로그램 실행 전에는 컴파일되면서 정적바인딩됨 (참조변수 타입의 메소드를 가리킴)
	 */

}
